experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run1_vclients1_workerthreads16_client3_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       17758 ops,     257 (avg:     253) ops/sec, 1.02MB/sec (avg: 1023.84KB/sec),  3.88 (avg:  3.94) msec latency

1         Threads
1         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets         253.68          ---          ---      3.93600      1023.84 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals       253.68         0.00         0.00      3.93600      1023.84 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.840         0.02
SET       0.850         0.02
SET       0.870         0.03
SET       0.890         0.03
SET       0.900         0.05
SET       0.910         0.05
SET       0.920         0.06
SET       0.930         0.09
SET       0.940         0.13
SET       0.950         0.16
SET       0.960         0.22
SET       0.970         0.25
SET       0.980         0.30
SET       0.990         0.37
SET       1.000         0.91
SET       1.100         3.14
SET       1.200         7.37
SET       1.300        13.19
SET       1.400        18.90
SET       1.500        25.17
SET       1.600        30.53
SET       1.700        35.28
SET       1.800        39.20
SET       1.900        42.34
SET       2.000        45.00
SET       2.100        47.35
SET       2.200        49.34
SET       2.300        50.99
SET       2.400        52.28
SET       2.500        53.47
SET       2.600        54.51
SET       2.700        55.50
SET       2.800        56.37
SET       2.900        56.96
SET       3.000        57.62
SET       3.100        58.14
SET       3.200        58.61
SET       3.300        59.07
SET       3.400        59.54
SET       3.500        59.90
SET       3.600        60.28
SET       3.700        60.73
SET       3.800        61.06
SET       3.900        61.41
SET       4.000        61.77
SET       4.100        62.11
SET       4.200        62.49
SET       4.300        62.84
SET       4.400        63.21
SET       4.500        63.56
SET       4.600        64.08
SET       4.700        64.55
SET       4.800        64.97
SET       4.900        65.38
SET       5.000        65.84
SET       5.100        66.26
SET       5.200        66.71
SET       5.300        67.19
SET       5.400        67.75
SET       5.500        68.32
SET       5.600        68.84
SET       5.700        69.48
SET       5.800        70.02
SET       5.900        70.72
SET       6.000        71.34
SET       6.100        72.04
SET       6.200        72.73
SET       6.300        73.47
SET       6.400        74.19
SET       6.500        75.01
SET       6.600        75.77
SET       6.700        76.57
SET       6.800        77.41
SET       6.900        78.35
SET       7.000        79.30
SET       7.100        80.33
SET       7.200        81.42
SET       7.300        82.48
SET       7.400        83.52
SET       7.500        84.68
SET       7.600        85.95
SET       7.700        87.03
SET       7.800        88.23
SET       7.900        89.33
SET       8.000        90.36
SET       8.100        91.44
SET       8.200        92.27
SET       8.300        93.17
SET       8.400        93.91
SET       8.500        94.48
SET       8.600        94.92
SET       8.700        95.42
SET       8.800        95.94
SET       8.900        96.30
SET       9.000        96.60
SET       9.100        96.93
SET       9.200        97.12
SET       9.300        97.31
SET       9.400        97.43
SET       9.500        97.61
SET       9.600        97.74
SET       9.700        97.89
SET       9.800        98.05
SET       9.900        98.20
SET      10.000        98.64
SET      11.000        99.03
SET      12.000        99.20
SET      13.000        99.30
SET      14.000        99.43
SET      15.000        99.55
SET      16.000        99.67
SET      17.000        99.76
SET      18.000        99.80
SET      19.000        99.81
SET      20.000        99.82
SET      21.000        99.83
SET      22.000        99.83
SET      23.000        99.85
SET      24.000        99.86
SET      25.000        99.88
SET      26.000        99.88
SET      27.000        99.90
SET      28.000        99.92
SET      29.000        99.92
SET      30.000        99.93
SET      34.000        99.94
SET      35.000        99.94
SET      38.000        99.95
SET      39.000        99.95
SET      40.000        99.96
SET      57.000        99.97
SET      62.000        99.97
SET      63.000        99.98
SET      65.000        99.98
SET      66.000        99.99
SET     100.000       100.00
---
---