experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run1_vclients24_workerthreads8_client2_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       90525 ops,    1437 (avg:    1293) ops/sec, 5.67MB/sec (avg: 5.10MB/sec), 16.64 (avg: 18.56) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1293.08          ---          ---     18.55600      5218.91 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1293.08         0.00         0.00     18.55600      5218.91 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       3.200         0.00
SET       3.300         0.00
SET       3.400         0.00
SET       3.800         0.01
SET       3.900         0.01
SET       4.100         0.01
SET       4.200         0.01
SET       4.300         0.01
SET       4.400         0.02
SET       4.500         0.02
SET       4.600         0.03
SET       4.700         0.03
SET       4.800         0.03
SET       4.900         0.04
SET       5.000         0.04
SET       5.100         0.04
SET       5.200         0.05
SET       5.300         0.05
SET       5.400         0.06
SET       5.500         0.06
SET       5.600         0.07
SET       5.700         0.08
SET       5.800         0.09
SET       5.900         0.10
SET       6.000         0.11
SET       6.100         0.12
SET       6.200         0.13
SET       6.300         0.14
SET       6.400         0.16
SET       6.500         0.18
SET       6.600         0.20
SET       6.700         0.22
SET       6.800         0.25
SET       6.900         0.28
SET       7.000         0.31
SET       7.100         0.35
SET       7.200         0.38
SET       7.300         0.43
SET       7.400         0.47
SET       7.500         0.50
SET       7.600         0.56
SET       7.700         0.60
SET       7.800         0.64
SET       7.900         0.69
SET       8.000         0.75
SET       8.100         0.81
SET       8.200         0.88
SET       8.300         0.94
SET       8.400         1.02
SET       8.500         1.08
SET       8.600         1.18
SET       8.700         1.27
SET       8.800         1.37
SET       8.900         1.49
SET       9.000         1.58
SET       9.100         1.69
SET       9.200         1.78
SET       9.300         1.92
SET       9.400         2.04
SET       9.500         2.18
SET       9.600         2.30
SET       9.700         2.47
SET       9.800         2.64
SET       9.900         2.80
SET      10.000         3.83
SET      11.000         6.85
SET      12.000        11.49
SET      13.000        17.27
SET      14.000        23.79
SET      15.000        31.00
SET      16.000        39.29
SET      17.000        47.84
SET      18.000        56.27
SET      19.000        63.82
SET      20.000        70.07
SET      21.000        75.34
SET      22.000        79.72
SET      23.000        83.60
SET      24.000        87.10
SET      25.000        90.01
SET      26.000        92.19
SET      27.000        93.92
SET      28.000        95.21
SET      29.000        96.18
SET      30.000        96.89
SET      31.000        97.43
SET      32.000        97.83
SET      33.000        98.11
SET      34.000        98.37
SET      35.000        98.59
SET      36.000        98.75
SET      37.000        98.92
SET      38.000        99.03
SET      39.000        99.14
SET      40.000        99.26
SET      41.000        99.35
SET      42.000        99.43
SET      43.000        99.49
SET      44.000        99.55
SET      45.000        99.61
SET      46.000        99.68
SET      47.000        99.74
SET      48.000        99.78
SET      49.000        99.81
SET      50.000        99.84
SET      51.000        99.86
SET      52.000        99.88
SET      53.000        99.89
SET      54.000        99.90
SET      55.000        99.91
SET      56.000        99.93
SET      57.000        99.94
SET      58.000        99.95
SET      59.000        99.95
SET      60.000        99.96
SET      61.000        99.96
SET      62.000        99.97
SET      63.000        99.97
SET      64.000        99.97
SET      65.000        99.97
SET      66.000        99.97
SET     130.000        99.98
SET     140.000        99.99
SET     150.000       100.00
---
---