experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run1_vclients24_workerthreads8_client3_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       91318 ops,    1526 (avg:    1304) ops/sec, 6.02MB/sec (avg: 5.14MB/sec), 15.83 (avg: 18.39) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1304.47          ---          ---     18.39400      5264.88 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1304.47         0.00         0.00     18.39400      5264.88 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.900         0.00
SET       2.100         0.00
SET       2.600         0.00
SET       2.800         0.00
SET       3.400         0.01
SET       3.500         0.01
SET       3.600         0.01
SET       3.700         0.01
SET       3.800         0.01
SET       4.000         0.01
SET       4.100         0.02
SET       4.200         0.02
SET       4.300         0.02
SET       4.400         0.02
SET       4.500         0.03
SET       4.600         0.03
SET       4.700         0.04
SET       4.800         0.05
SET       4.900         0.05
SET       5.000         0.06
SET       5.100         0.07
SET       5.200         0.08
SET       5.300         0.09
SET       5.400         0.09
SET       5.500         0.10
SET       5.600         0.11
SET       5.700         0.12
SET       5.800         0.13
SET       5.900         0.15
SET       6.000         0.16
SET       6.100         0.17
SET       6.200         0.19
SET       6.300         0.20
SET       6.400         0.22
SET       6.500         0.25
SET       6.600         0.27
SET       6.700         0.30
SET       6.800         0.33
SET       6.900         0.37
SET       7.000         0.41
SET       7.100         0.43
SET       7.200         0.48
SET       7.300         0.54
SET       7.400         0.59
SET       7.500         0.65
SET       7.600         0.69
SET       7.700         0.74
SET       7.800         0.79
SET       7.900         0.84
SET       8.000         0.91
SET       8.100         0.97
SET       8.200         1.05
SET       8.300         1.11
SET       8.400         1.18
SET       8.500         1.28
SET       8.600         1.38
SET       8.700         1.47
SET       8.800         1.58
SET       8.900         1.68
SET       9.000         1.79
SET       9.100         1.93
SET       9.200         2.06
SET       9.300         2.18
SET       9.400         2.32
SET       9.500         2.47
SET       9.600         2.61
SET       9.700         2.77
SET       9.800         2.93
SET       9.900         3.10
SET      10.000         4.19
SET      11.000         7.36
SET      12.000        12.13
SET      13.000        18.07
SET      14.000        24.68
SET      15.000        32.08
SET      16.000        40.20
SET      17.000        48.95
SET      18.000        57.34
SET      19.000        65.02
SET      20.000        71.19
SET      21.000        76.13
SET      22.000        80.42
SET      23.000        84.26
SET      24.000        87.69
SET      25.000        90.43
SET      26.000        92.62
SET      27.000        94.19
SET      28.000        95.47
SET      29.000        96.37
SET      30.000        97.07
SET      31.000        97.56
SET      32.000        97.92
SET      33.000        98.19
SET      34.000        98.43
SET      35.000        98.62
SET      36.000        98.78
SET      37.000        98.96
SET      38.000        99.09
SET      39.000        99.20
SET      40.000        99.29
SET      41.000        99.37
SET      42.000        99.45
SET      43.000        99.53
SET      44.000        99.58
SET      45.000        99.65
SET      46.000        99.71
SET      47.000        99.76
SET      48.000        99.79
SET      49.000        99.83
SET      50.000        99.85
SET      51.000        99.87
SET      52.000        99.89
SET      53.000        99.90
SET      54.000        99.91
SET      55.000        99.92
SET      56.000        99.93
SET      57.000        99.94
SET      58.000        99.94
SET      59.000        99.95
SET      60.000        99.95
SET      61.000        99.96
SET      62.000        99.96
SET      63.000        99.96
SET      64.000        99.97
SET      65.000        99.97
SET      68.000        99.97
SET      70.000        99.97
SET      77.000        99.97
SET     130.000       100.00
SET     140.000       100.00
---
---